In [2]:
import pandas as pd
import requests
from bs4 import BeautifulSoup
import time
import modulo as md

In [3]:
headers={'user-agent':'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/116.0.0.0 Safari/537.36'}

## Funcion que se encarga de tomar todos los equipos en la lista de ligas que le de y ponerlos en un df junto con sus ids en la web

In [4]:
#codigos ligas:
paises=[9,10],[12,17],[11,18],[13,60],[20,33]
#0inglesa=[9,10]
#1españolas=[12,17]
#2italianas=[10,18]
#3francesa=[13,60]
#4alemanas=[20,33]

In [5]:
def teams_df(ListLiguesNumbers):# ejemplo lista paises=[9,10],[12,17],[10,18],[13,60],[20,33]
    equiposall=[]               #devuelve un df
    codigosall=[]
    
    for pais in ListLiguesNumbers:
        print(pais)
        
        for liga in pais:
            
            print(liga)
            url=f'https://fbref.com/es/comps/{liga}'
            res=requests.get(url, headers=headers)
            equipos=md.get_teams(res)
            time.sleep(2)
            equiposall+=equipos[0]
            codigosall+=equipos[1]
            
    columnas=['Nombre', 'id Web']
    datos = {
    'Nombre': equiposall,
    'id Web': codigosall
    }
    equipos=pd.DataFrame(datos, columns=columnas)
    return equipos

In [6]:
equipos=teams_df(paises)
equipos

[9, 10]
9
10
[12, 17]
12
17
[11, 18]
11
18
[13, 60]
13
60
[20, 33]
20
33

           Nombre    id Web
0         Arsenal  18bb7c10
1     Aston Villa  8602292d
2     Bournemouth  4ba7cbea
3       Brentford  cd051869
4        Brighton  d07537b9
..            ...       ...
195     Osnabrück  3ce4e72c
196  Paderborn 07  d9f93f02
197    Schalke 04  c539e393
198     St. Pauli  54864664
199         Wehen  432f2430

[200 rows x 2 columns]

# Obtengo todos los umeros en las id web de los equipos y los vuelvo mis ids locales, para el ml

In [7]:
equipos['id_ml']=equipos['id Web'].apply(md.get_numbers)

In [8]:
equipos.drop_duplicates('id_ml')

           Nombre    id Web     id_ml
0         Arsenal  18bb7c10     18710
1     Aston Villa  8602292d   8602292
2     Bournemouth  4ba7cbea        47
3       Brentford  cd051869    051869
4        Brighton  d07537b9    075379
..            ...       ...       ...
195     Osnabrück  3ce4e72c      3472
196  Paderborn 07  d9f93f02     99302
197    Schalke 04  c539e393    539393
198     St. Pauli  54864664  54864664
199         Wehen  432f2430   4322430

[200 rows x 3 columns]

## hago que todos los ids tengan la misma longitud

In [9]:
max_length = equipos['id_ml'].str.len().max()

# Aplicar zfill para igualar la longitud
equipos['id_ml'] = equipos['id_ml'].str.pad(width=max_length, side='right', fillchar='0')
equipos

           Nombre    id Web     id_ml
0         Arsenal  18bb7c10  18710000
1     Aston Villa  8602292d  86022920
2     Bournemouth  4ba7cbea  47000000
3       Brentford  cd051869  05186900
4        Brighton  d07537b9  07537900
..            ...       ...       ...
195     Osnabrück  3ce4e72c  34720000
196  Paderborn 07  d9f93f02  99302000
197    Schalke 04  c539e393  53939300
198     St. Pauli  54864664  54864664
199         Wehen  432f2430  43224300

[200 rows x 3 columns]

## compruebo que no hayan ids duplicados

In [10]:
dfs=[]
for index, row in equipos.iterrows():
    equipo=row['id_ml']
    df=equipos[equipos['id_ml']==equipo]
    
    if df.shape[0] != 1:
        dfs.append(df)

len(dfs)

0

In [19]:
equipos.to_csv(r'C:\Users\ARTUROS\Desktop\Archivos Adrian\personal\proyectos personales\lacaprichosa\dataset\All_teams.csv',index=False)

esto es solo la prueba para intentar crear la funcion que cree ids

In [49]:
def lista_ids(cantidad, digitos):
    lista=[123,321]
    return lista

def prueba():
    listcantidades=[2]
    listdigitos=[3]
    
    for cantidad, digito in zip(listcantidades,listdigitos):
        
        condicion = lambda x: len(x) == digito
        lista=lista_ids(cantidad,listdigitos)
        lista_de_cadenas = list(map(str, lista))
        if (len(lista) != cantidad) or (len([elemento for elemento in lista_de_cadenas if condicion(elemento)])!= cantidad):
            
            return 'Reprobado' 
        
    return 'Aprobado'